app/Controllers/News.php

    public function new()
    {

        helper('form');

        $model = model(CategoryModel::class);

        if ($data['category'] = $model->findAll()) {
---
SELECT *
FROM `category`

    public function create()
    {
        helper('form');

        // Checks whether the submitted data passed the validation rules.
        if (
            !$this->validate([
                'title' => 'required|max_length[255]|min_length[3]',
                'body' => 'required|max_length[5000]|min_length[10]',
                'id_category' => 'required',
            ])
        ) {
            // The validation fails, so returns the form.
            return $this->new();
        }

        // Gets the validated data.
        $post = $this->validator->getValidated();

        $model = model(NewsModel::class);


        $model->save([
            'title' => $post['title'],
            'slug' => url_title($post['title'], '-', true),
            'body' => $post['body'],
            'id_category' => $post['id_category'],
        ]);
---
INSERT INTO `news` (`title`, `slug`, `body`, `id_category`) VALUES ('ppppppppppppppp', 'ppppppppppppppp', 'ppppppppppppp', '1')

    public function delete($id)
    {

        if ($id == null) {
            throw new PageNotFoundException('Cannot delete the item');
        }

        $model = model(NewsModel::class);

        /*if ($model->where('id', $id)->find()) {
            $model->where('id', $id)->delete();
        } else {
            throw new PageNotFoundException('Selected item does not exist in database');
        }*/

        if ($model->getById($id)) {
            $model->delete($id);
---
DELETE FROM `news`
WHERE `id` IN ('28')

    public function update($id)
    {

        helper('form');

        if ($id == null) {
            throw new PageNotFoundException('Cannot update the item');
        }

        $model = model(NewsModel::class);
        $modelCategory = model(CategoryModel::class);

        if ($model->where('id', $id)->find()) {
            $data = [
                'news' => $model->getById($id),
                'title' => 'Update item',
                'category' => $modelCategory->findAll(),
---
SELECT *
FROM `news`
WHERE `id` = '33'
SELECT *
FROM `category`

    public function updatedItem($id)
    {

        helper('form');

        if (
            !$this->validate([
                'title' => 'required|max_length[255]|min_length[3]',
                'body' => 'required|max_length[5000]|min_length[10]',
                'id_category' => 'required',
            ])
        ) {
            return $this->update($id);
        }

        $post = $this->validator->getValidated();

        $data = [
            'id' => $id,
            'title' => $post['title'],
            'slug' => url_title($post['title'], '-', true),
            'body' => $post['body'],
            'id_category' => $post['id_category'],
        ];

        $model = model(NewsModel::class);
        $model->save($data);
---
UPDATE `news` SET `title` = 'Damn son', `slug` = 'damn-son', `body` = '                                    Where you find this                        ', `id_category` = '5'
WHERE `news`.`id` IN ('33')