app/Models/CategoryModel.php

SELECT *
FROM `category`
---
    public function getCategories() {

        return $this->findAll();