app/Models/NewsModel.php

    public function getNews($slug = false)
    {
        if ($slug === false) {
            $sql = $this->select('news.*,category.category');
            $sql = $this->join('category', 'news.id_category=category.id');
            $sql = $this->findAll();
            return $sql;
        }
        $sql = $this->select('news.*,category.category');
        $sql = $this->join('category', 'news.id_category=category.id');
        $sql = $this->where(['slug' => $slug]);
        $sql = $this->first();
---
SELECT `news`.*, `category`.`category`
FROM `news`
JOIN `category` ON `news`.`id_category`=`category`.`id`

    public function getById($id)
    {

        return $this->where(['id' => $id])->first();
---
SELECT *
FROM `news`
WHERE `id` = '33'
 LIMIT 1