app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'user'
AND `password` = '1234'
---
    public function checkUser($user, $pass)
    {
        return $this->where(['username' => $user, 'password' => $pass])->find();